### Heroes Of Pymoli Data Analysis
* Of the 1163 active players, the vast majority are male (84%). There also exists, a smaller, but notable proportion of female players (14%).

* Our peak age demographic falls between 20-24 (44.8%) with secondary groups falling between 15-19 (18.60%) and 25-29 (13.4%).  
-----

### Note
* Instructions have been included for each segment. You do not have to follow them exactly, but they are included to help you think through the steps.

In [35]:
# Dependencies and Setup
import pandas as pd
import numpy as np

# File to Load 
file_to_load = "Resources/purchase_data.csv"


# Read Purchasing File and store into Pandas data frame
purchase_data_df = pd.read_csv(file_to_load) 
purchase_data_df.head()

new_purchase_data_df = pd.read_csv(file_to_load) 
new_purchase_data_df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [36]:
purchase_data_df.columns

Index(['Purchase ID', 'SN', 'Age', 'Gender', 'Item ID', 'Item Name', 'Price'], dtype='object')

## Player Count

* Display the total number of players

In [37]:
total_players = purchase_data_df["SN"].nunique()
total_players

576

In [38]:
#Dataframe for total players
#Parentheses because it is a function
#Dictionary key/value pair
total_players = pd.DataFrame({"Total Players": [total_players]})
total_players
#purchase_data_df["SN":"Total Players"].value_counts())

   Total Players
0            576

## Purchasing Analysis (Total)

* Run basic calculations to obtain number of unique items, average price, etc.


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [39]:
#Number of unique items
unique_items = purchase_data_df["Item ID"].nunique()
unique_items

183

In [40]:
#Calulation for average price
average_price = purchase_data_df["Price"].mean()
average_price

3.050987179487176

In [41]:
#Total number of purchases
#.count use for total
total_purchases = purchase_data_df["Purchase ID"].count()
total_purchases

780

In [42]:
#Total Revenue
total_revenue = purchase_data_df["Price"].sum()
total_revenue

2379.77

In [43]:
#Display the summary data frame
total_players = pd.DataFrame({"Number of Unique Items": [unique_items],
                              "Average Price": average_price,
                              "Number of Purchases": [total_purchases],
                              "Total Revenue": [total_revenue]})
total_players["Average Price"] = total_players["Average Price"].map("${:.2f}".format)
total_players["Total Revenue"] = total_players["Total Revenue"].map("${:.2f}".format)
total_players

   Number of Unique Items Average Price  Number of Purchases Total Revenue
0                     183         $3.05                  780      $2379.77

* Percentage and Count of Male Players


* Percentage and Count of Female Players


* Percentage and Count of Other / Non-Disclosed

In [44]:
#Remove Duplicates
new_purchase_data_df = new_purchase_data_df.loc[:, ["Gender", "SN", "Age"]]
new_purchase_data_df = new_purchase_data_df.drop_duplicates()
num_players = new_purchase_data_df.count()[0]
num_players

576

In [45]:
#Get Total Count of each gender
#total_gender = new_purchase_data_df.groupby(["Gender"]).SN.nunique()
#total_gender

In [46]:
#Percentage of each gender type
#new_purchase_data_df['Gender'].value_counts(normalize=True) * 100

In [47]:
# GENDER DEMOGRAPHICS
# Calculate players by gender
players_by_gender = purchase_data_df['Gender'].value_counts()
players_by_gender_df = pd.DataFrame(players_by_gender)

# Calculate percent of players by gender
percent_players = (purchase_data_df['Gender'].value_counts() / (purchase_data_df['Gender'].count())) * 100

# Add 'Percent of Players' to table
players_by_gender_df['Percent of Players'] = percent_players
gender_demographics_df = pd.DataFrame(players_by_gender_df)
gender_demographics_df

# Rename 'Gender' to 'Total Count'
new_gender_demographics_df = gender_demographics_df.rename(columns={
    'Gender': 'Total Count',
})
new_gender_demographics_df

                       Total Count  Percent of Players
Male                           652           83.589744
Female                         113           14.487179
Other / Non-Disclosed           15            1.923077


## Purchasing Analysis (Gender)

* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. by gender




* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [48]:
#Male Purchase Count
male_purchases = purchase_data_df["Gender"].value_counts()['Male']
male_purchases

652

In [49]:
#Female Purchase Count
female_purchases = purchase_data_df["Gender"].value_counts()['Female']
female_purchases

113

In [50]:
#Other Purchase Count
other_purchases = purchase_data_df["Gender"].value_counts()['Other / Non-Disclosed']
other_purchases

15

In [51]:
#Male/Female/Other Average Purchase Price
purchase_data_df.groupby('Gender', as_index=False).Price.mean()

                  Gender     Price
0                 Female  3.203009
1                   Male  3.017853
2  Other / Non-Disclosed  3.346000

## Age Demographics

* Establish bins for ages


* Categorize the existing players using the age bins. Hint: use pd.cut()


* Calculate the numbers and percentages by age group


* Create a summary data frame to hold the results


* Optional: round the percentage column to two decimal points


* Display Age Demographics Table

In [52]:
#Dataframe of player ages
#Create bin names
group_names = ["<10", "10-14", "15-19", "20-24", "25-29", "30-34", "35-39", "40+"]
#Define bin names
bins = [0, 9, 14, 19, 24, 29, 34, 39, 150]
purchase_data_df["Age Ranges"] = pd.cut(purchase_data_df["Age"], bins, labels=group_names)
purchase_data_df

#Total By Age Range
total_by_age = purchase_data_df["Age Ranges"].value_counts()
total_by_age

#Percentage of Players
percentage_of_players = total_by_age / num_players *100 
percentage_of_players

total_ages = pd.DataFrame({"Total Count": total_by_age,
                           "Percentage of Players": percentage_of_players})
total_ages

total_ages["Percentage of Players"] = total_ages["Percentage of Players"].map("{:.2f}%".format)
total_ages = total_ages.sort_index()
total_ages

       Total Count Percentage of Players
<10             23                 3.99%
10-14           28                 4.86%
15-19          136                23.61%
20-24          365                63.37%
25-29          101                17.53%
30-34           73                12.67%
35-39           41                 7.12%
40+             13                 2.26%

## Purchasing Analysis (Age)

* Bin the purchase_data data frame by age


* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. in the table below


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [53]:
#Create bin names
group_names = ["<10", "10-14", "15-19", "20-24", "25-29", "30-34", "35-39", "40+"]
#Define bin names
bins = [0, 9, 14, 19, 24, 29, 34, 39, 150]
purchase_data_df["Age Ranges"] = pd.cut(purchase_data_df["Age"], bins, labels=group_names)
purchase_data_df

purchase_data_age = purchase_data_df.groupby(by='Age Ranges')

#Create summary data

purchase_count = purchase_data_age["Price"].count()
avg_price = round(purchase_data_age["Price"].mean(), 2)
total_purchase = round(purchase_data_age["Price"].sum(), 2)
avg_purchase_person = round(total_purchase/purchase_count ,2)

purchase_age = pd.DataFrame({"Purchase Count": purchase_count, "Average Purchase Price": avg_price, "Total Purchase Price": total_purchase, "Average Per Person": avg_purchase_person})
purchase_age["Average Purchase Price"] = purchase_age["Average Purchase Price"].map("${:.2f}".format)
purchase_age["Total Purchase Price"] = purchase_age["Total Purchase Price"].map("${:.2f}".format)
purchase_age["Average Per Person"] = purchase_age["Average Per Person"].map("${:.2f}".format)
purchase_age = purchase_age.sort_index()
purchase_age

,Purchase Count,Average Purchase Price,Total Purchase Price,Average Per Person
Age Ranges,,,,
<10,23,$3.35,$77.13,$3.35
10-14,28,$2.96,$82.78,$2.96
15-19,136,$3.04,$412.89,$3.04
20-24,365,$3.05,$1114.06,$3.05
25-29,101,$2.90,$293.00,$2.90
30-34,73,$2.93,$214.00,$2.93
35-39,41,$3.60,$147.67,$3.60
40+,13,$2.94,$38.24,$2.94

## Top Spenders

* Run basic calculations to obtain the results in the table below


* Create a summary data frame to hold the results


* Sort the total purchase value column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

In [54]:
total_by_user = purchase_data_df.groupby(["SN"]).sum()["Price"]
average_by_user = round(purchase_data_df.groupby(["SN"]).mean()["Price"], 2)
count_by_user = purchase_data_df.groupby(["SN"]).count()["Price"]

top_spenders = pd.DataFrame({"Total Purchase Value": total_by_user, "Average Purchase Price": average_by_user, "Purchase Count": count_by_user})
top_spenders["Average Purchase Price"] = top_spenders["Average Purchase Price"].map("${:.2f}".format)

top_spenders.sort_values("Total Purchase Value", ascending=False).head(10)

              Total Purchase Value Average Purchase Price  Purchase Count
SN
Lisosia93                    18.96                  $3.79               5
Idastidru52                  15.45                  $3.86               4
Chamjask73                   13.83                  $4.61               3
Iral74                       13.62                  $3.40               4
Iskadarya95                  13.10                  $4.37               3
Ilarin91                     12.70                  $4.23               3
Ialallo29                    11.84                  $3.95               3
Tyidaim51                    11.83                  $3.94               3
Lassilsala30                 11.51                  $3.84               3
Chadolyla44                  11.46                  $3.82               3

## Most Popular Items

* Retrieve the Item ID, Item Name, and Item Price columns


* Group by Item ID and Item Name. Perform calculations to obtain purchase count, item price, and total purchase value


* Create a summary data frame to hold the results


* Sort the purchase count column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

In [55]:
popular_items_group = purchase_data_df.groupby(["Item ID", "Item Name"])
popular_purchase_count = popular_items_group['Price'].count()
popular_price = popular_items_group['Price'].mean()
total_purchase_price = popular_items_group["Price"].sum()

#Create the dataframe
popular_items_df = pd.DataFrame({'Purchase Count': popular_purchase_count, "Total Purchase Value": total_purchase_price, "Item Price": popular_price})
popular_items_df["Item Price"] = popular_items_df["Item Price"].map("${:.2f}".format)
popular_items_df.sort_values("Purchase Count", ascending=False).head()

,,Purchase Count,Total Purchase Value,Item Price
Item ID,Item Name,,,
178,"Oathbreaker, Last Hope of the Breaking Storm",12,50.76,$4.23
145,Fiery Glass Crusader,9,41.22,$4.58
108,"Extraction, Quickblade Of Trembling Hands",9,31.77,$3.53
82,Nirvana,9,44.10,$4.90
19,"Pursuit, Cudgel of Necromancy",8,8.16,$1.02

## Most Profitable Items

* Sort the above table by total purchase value in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the data frame

In [56]:
#Sort the above table with .head and ascending
popular_items_df.sort_values("Total Purchase Value", ascending=False).head()

,,Purchase Count,Total Purchase Value,Item Price
Item ID,Item Name,,,
178,"Oathbreaker, Last Hope of the Breaking Storm",12,50.76,$4.23
82,Nirvana,9,44.10,$4.90
145,Fiery Glass Crusader,9,41.22,$4.58
92,Final Critic,8,39.04,$4.88
103,Singed Scalpel,8,34.80,$4.35